src/Catalogs/РабочиеМестаЛинеек/РабочиеМестаЛинеек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РабочиеМестаЛинеек</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Авторизовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаЗаданийПоВремениПоступления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаРабочихМест</name>
    <type>
      <types>CatalogRef.ГруппыРабочихМест</types>
    </type>
  </attributes>
  <attributes>
    <name>Стенд</name>
    <type>
      <types>CatalogRef.Стенды</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратнаяТара</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучениеЗаданияСканированием</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучениеЗаданияСканированиемВТ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаканчиватьПредыдущийЭтап</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВводIMEI</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВводMACАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВводКодDanfoss</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВводBT</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьБуфер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнитьТехОснастку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>ГруппаНоменклатуры</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Комплектация</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехОперации</name>
    <attributes>
      <name>ТехОперация</name>
      <type>
        <types>CatalogRef.ТехОперации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/ЭтапыПроизводственныхЗаданий/ЭтапыПроизводственныхЗаданий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭтапыПроизводственныхЗаданий</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаЛинеек</types>
    </type>
  </resources>
  <resources>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Ремонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ПЗ</name>
    <type>
      <types>DocumentRef.ПроизводственноеЗадание</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Изделие</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БарКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/РабочиеМестаЛинеек/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Функция ЕстьПрефиксЭтапа(ГруппаНоменклатуры)
Возврат(ЗначениеЗаполнено(ГруппаНоменклатуры.Префикс));
КонецФункции

&НаКлиенте
Процедура ТабличнаяЧастьГруппаНоменклатурыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Не ЕстьПрефиксЭтапа(ВыбранноеЗначение) Тогда
	Сообщить("Выберите группу номенклатуры с префиксом этапа!");
	СтандартнаяОбработка = Ложь;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ПроверитьПрименениеРМ()
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭтапыПроизводственныхЗаданий.ПЗ
	|ИЗ
	|	РегистрСведений.ЭтапыПроизводственныхЗаданий КАК ЭтапыПроизводственныхЗаданий
	|ГДЕ
	|	ЭтапыПроизводственныхЗаданий.РабочееМесто = &РабочееМесто
	|	И ЭтапыПроизводственныхЗаданий.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
Запрос.УстановитьПараметр("РабочееМесто", Объект.Ссылка);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сообщить(ВыборкаДетальныеЗаписи.ПЗ);
		КонецЦикла;
	Возврат(Ложь);
	Иначе
	Возврат(Истина);
	КонецЕсли; 
КонецФункции

&НаКлиенте
Процедура АвторизованоПриИзменении(Элемент)
	//Если Не Объект.Авторизовано Тогда
	//	Если Не ПроверитьПрименениеРМ() Тогда
	//	Объект.Авторизовано = Истина;
	//	Сообщить("Перед снятием флага авторизации следует изменить текущее рабочее место у выше перечисленных производственных заданий!");
	//	КонецЕсли;
	//КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеПодбором(Команда)
ПараметрыПодбора = Новый Структура("ЗакрыватьПриВыборе, МножественныйВыбор", Ложь, Истина);
ОткрытьФорму("Справочник.ТехОперации.ФормаВыбора", ПараметрыПодбора, Элементы.ТехОперации);
КонецПроцедуры

&НаСервере
Процедура ДобавитьТОНаСервере(ВыбранноеЗначение)
	Для Каждого Значение Из ВыбранноеЗначение Цикл
		Если Объект.ТехОперации.НайтиСтроки(Новый Структура("ТехОперация", Значение)).Количество() = 0 Тогда
      	ТЧ = Объект.ТехОперации.Добавить();
      	ТЧ.ТехОперация = Значение;
    	КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТехОперацииОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
ДобавитьТОНаСервере(ВыбранноеЗначение);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
СписокТО = Новый СписокЗначений;

	Для каждого ТЧ Из Объект.ТехОперации Цикл
		Если ТЧ.ТехОперация.ЭтоГруппа Тогда
		ТО = Справочники.ТехОперации.ВыбратьИерархически(ТЧ.ТехОперация);
			Пока ТО.Следующий() Цикл
		    	Если Не ТО.ЭтоГруппа Тогда
					Если СписокТО.НайтиПоЗначению(ТО.Ссылка) = Неопределено Тогда	
					СписокТО.Добавить(ТО.Ссылка);
					Иначе
					Сообщить(""+СокрЛП(ТО.Ссылка.Наименование)+" - уже была добавлена в список ТО!");				
					Отказ = Истина;
					КонецЕсли;
				КонецЕсли;				
			КонецЦикла; 
		Иначе					
			Если СписокТО.НайтиПоЗначению(ТЧ.ТехОперация) = Неопределено Тогда	
			СписокТО.Добавить(ТЧ.ТехОперация);
			Иначе
			Сообщить(""+СокрЛП(ТЧ.ТехОперация.Наименование)+" - уже была добавлена в список ТО!");
			Отказ = Истина;				
			КонецЕсли;				
		КонецЕсли;
	КонецЦикла; 
КонецПроцедуры
